{
  "selectedTemplate": 1,
  "headings": {
    "work": "Work Experience",
    "education": "Education",
    "skills": "Skills",
    "projects": "Personal Projects",
    "awards": ""
  },
  "basics": {
    "name": "Sandeep Prasad Jaiswal",
    "email": "sandeepjswl123@gmail.com",
    "phone": "+91-7584033349",
    "location": {
      "address": "Bengaluru"
    },
    "website": "http://sandyjswl.com/"
  },
  "education": [
    {
      "institution": "Siliguri Institute of Technology",
      "location": "Siliguri",
      "area": "Computer Science",
      "startDate": "August 2015",
      "endDate": "June 2019",
      "studyType": "Bachelor of Technology",
      "cgpa": "8.57"
    }
  ],
  "work": [
    {
      "highlights": [
        "Designed, Implemented and shipped new features on internal applications. This decreased time to deploy new applications on Kubernetes by 40%.",
        "Improved monitoring stack and helped maintain service availability of 99.95% by integrating Grafana and Victoria Metrics with backend services.",
        "Developed a tool which allowed backend services to fail gracefully when there is traffic congestion, resulting in echanced user experience and better customer retention.",
        "Evaluated multiple open source libraries for Distributed Tracing like OpenCensus and OpenTelemetry and assessed the complexity of integrating them with backend services.",
        "Took on-call responsibility for DevOps team during high traffic events and resolved Live issues.",
        "Tech Stack: Kubernetes, Docker, React, Ruby on Rails, Prometheus, Victoria Metrics, AWS, DevOps"
      ],
      "company": "Disney+ Hotstar",
      "position": "Software Development Engineer",
      "location": "Bengaluru",
      "startDate": "August 2021",
      "endDate": "Present"
    },
    {
      "company": "Thoughtworks",
      "location": "Bengaluru",
      "startDate": "June 2019",
      "endDate": "August 2021",
      "highlights": [
        "Doubled the revenue of a large e-commerce company by building scalable and reliable microservices which helped the company move to a Marketplace business model.",
        "Automated performance tests using Python and Locust to benchmark backend services. This helped discover API endpoints with large response time.",
        "Optimized inefficient JPA queries using Entity Graph, this enabled the backend services to handle over 3000 requests/second.",
        "Enhanced developer experience by adding integration tests using Junit and Mockito for existing backend services. This reduced frequency of bugs and increased availability of services.",
        "Organised multiple Data Analysis workshops using Python and Pandas, in collaboration with She Loves Data.",
        "Mentored new graduates and onboarded them in new projects by sharing assignments, performing code walkthrough and code reviews.",
        "Tech Stack: Java, Spring Boot, Angular, Microservices, PostgreSQL"
      ],
      "position": "Application Developer"
    },
    {
      "company": "Thoughtworks",
      "location": "Bengaluru",
      "startDate": "January 2019",
      "endDate": "April 2019",
      "highlights": [
        "Trained in Agile Methodologies and industry best practices like TDD and Pair Programming.",
        "Developed a fullstack e-commerce application using Spring MVC to enable a business to sell their products online."
      ],
      "position": "Application Developer Intern"
    },
    {
      "company": "AsknBid Innovation Factory",
      "location": "Remote",
      "startDate": "June 2018",
      "endDate": "November 2018",
      "highlights": [
        "Implemented a hybrid Machine Learning model to perform sentiment analysis using RAKE and TF-IDF.",
        "Ranked online articles and websites by scraping data and then analysing them using a sentiment analysis model."
      ],
      "position": "Python Developer Intern"
    }
  ],
  "skills": [
    {
      "level": "",
      "keywords": [
        "Java",
        "Python",
        "Go",
        "Bash"
      ],
      "name": "Backend"
    },
    {
      "keywords": [
        "React",
        "Angular",
        "Material UI",
        "Jasmine"
      ],
      "name": "Frontend"
    },
    {
      "keywords": [
        "AWS",
        "Kubernetes",
        "Docker",
        "GoCD",
        "Helm"
      ],
      "name": "Infrastructure"
    },
    {
      "keywords": [
        "SQL Server",
        "Apache Cassandra",
        "PostgreSQL",
        "MongoDB"
      ],
      "name": "Databases"
    },
    {
      "keywords": [
        "Spring Boot",
        "Flask",
        "Locust",
        "Pandas",
        "Numpy",
        "Junit",
        "Mockito"
      ],
      "name": "Frameworks"
    },
    {
      "keywords": [
        "Victoria Metrics",
        "Prometheus",
        "Grafana",
        "Maven",
        "Git"
      ],
      "name": "Others"
    }
  ],
  "projects": [
    {
      "description": "SocialHub is a website where you can share all your social media links using one url. Create a profile and add references to all your social profiles.",
      "url": "https://socialhub.sandyjswl.com/",
      "keywords": [
        "React",
        "Python",
        "FastAPI",
        "MongoDB"
      ],
      "name": "SocialHub"
    },
    {
      "keywords": [
        "Python",
        "Angular",
        "FastApi",
        "Pandas",
        "Matplotlib",
        "Google Cloud Platform"
      ],
      "name": "Cricket-Statsguru",
      "description": "Cricket-Statsguru is a web application where you can see cricket statistics of a particular player both graphically and numerically. The app also allows users to compare the stats of any two players."
    },
    {
      "keywords": [
        "Python",
        "BeautifulSoup",
        "Angular"
      ],
      "name": "Shopping Price Alert",
      "description": "Shopping Price Alert is a web application where users can enter the URL of a product from Amazon/Flipkart and they will be notified as soon as there is a price drop in the selected product."
    }
  ],
  "awards": [
    {
      "title": "",
      "date": "",
      "awarder": "",
      "summary": ""
    }
  ],
  "sections": [
    "templates",
    "profile",
    "work",
    "skills",
    "projects",
    "awards",
    "education"
  ]
}